{
  "en": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Learn More"
    },
    "headings": {
      "portfolio_intro": "WEB DEVELOPER, FUTURE SOFTWARE ENGINEER & UI/UX DESIGNER.",
      "about_me": "About Me",
      "hello": "Hello, I'm"
    },
    "content": {
      "introduction": "I'm a Developer and Designer based in Brazil, passionate about creating modern, functional and visually stunning digital experiences. I specialize in building interactive interfaces and I'm always improving my skills in UI/UX design and Development. I love exploring new technologies and turning ideas into reality through code and design.",
      "skills": {
        "web_dev": {
          "title": "Web Development",
          "description": "Specializing in creating visually stunning and user-friendly websites. Proficient in CSS, JavaScript, Python, and modern frameworks like React and Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "UI/UX Design",
          "description": "Passionate about crafting intuitive and engaging user experiences. Skilled in UI/UX design, leveraging tools like Figma, along with user research methodologies, marketing strategies, and conversion optimization techniques to enhance usability and business impact."
        },
        "software_development": {
          "title": "Software Development",
          "description": "Aiming to transition into software development, with a focus on building scalable and efficient applications. Familiar with Python, Java, and backend technologies."
        }
      }
    },
 "journey": {
  "title": "My Journey",
  "description": "A path shaped by curiosity, dedication, and continuous growth.",
  "paragraph": "From an early age, technology became more than curiosity — it became purpose.",
  "content_journey": "My journey into programming began when I was 10 years old, driven by a deep curiosity to understand how things worked behind the screen. With limited access to paid resources, I learned through self-study, experimentation, and persistence. At 14, this passion found direction when I joined IFRJ in Engenheiro Paulo de Frontin, enrolling in the Internet Technology program. There, I expanded my perspective on technology by engaging in academic projects, scientific research, article publications, and social initiatives, including teaching computer classes to underprivileged communities and elderly people. Now, as a graduate, I continue to refine my skills in development and design, strengthen my professional network, and evolve not only technically but also personally. Each step of this journey brings me closer to my goal: building meaningful, well-crafted digital experiences that create real impact.",
  "next": "Next Section"
}
  },

  "pt": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Saiba Mais"
    },
    "headings": {
      "portfolio_intro": "DESENVOLVEDOR WEB, FUTURO ENGENHEIRO DE SOFTWARE & DESIGNER UI/UX.",
      "about_me": "Sobre Mim",
      "hello": "Olá, eu sou"
    },
    "content": {
      "introduction": "Sou um Desenvolvedor e Designer do Brasil, apaixonado por criar experiências digitais modernas, funcionais e visualmente impressionantes. Especializo-me na construção de interfaces interativas e estou sempre aprimorando minhas habilidades em design UI/UX e desenvolvimento. Adoro explorar novas tecnologias e transformar ideias em realidade através do código e do design.",
      "skills": {
        "web_dev": {
          "title": "Desenvolvimento Web",
          "description": "Especializado na criação de sites visualmente impressionantes e fáceis de usar. Proficiente em CSS, JavaScript, Python e frameworks modernos como React e Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "Design UI/UX",
          "description": "Apaixonado por criar experiências de usuário intuitivas e envolventes. Hábil em design UI/UX, utilizando ferramentas como Figma, além de metodologias de pesquisa de usuários, estratégias de marketing e técnicas de otimização de conversão para melhorar a usabilidade e o impacto nos negócios."
        },
        "software_development": {
          "title": "Desenvolvimento de Software",
          "description": "Com o objetivo de fazer a transição para o desenvolvimento de software, com foco na construção de aplicativos escaláveis e eficientes. Familiarizado com Python, Java e tecnologias de backend."
        }
      }
    },
      "journey": {
  "title": "Minha Jornada",
  "description": "Uma trajetória construída por curiosidade, esforço e evolução constante.",
  "paragraph": "Desde muito cedo, a tecnologia deixou de ser apenas curiosidade e passou a ser propósito.",
  "content_journey": "Meu primeiro contato com programação aconteceu aos 10 anos, movido pela vontade de entender como as coisas funcionavam por trás da tela. Mesmo sem acesso a cursos pagos ou recursos avançados, aprendi de forma autodidata, explorando, errando e evoluindo a cada tentativa. Aos 14 anos, essa paixão ganhou direção quando ingressei no IFRJ de Engenheiro Paulo de Frontin, no curso de Tecnologia para Internet. Ali, ampliei minha visão sobre o impacto da tecnologia, participando de projetos acadêmicos, pesquisas científicas, publicações de artigos e ações sociais, como aulas de informática para comunidades carentes e idosos. Hoje, formado, sigo em constante evolução, aprofundando meus conhecimentos em desenvolvimento e design, construindo um networking sólido e aprimorando não apenas minhas habilidades técnicas, mas também minha mentalidade profissional. Cada etapa dessa jornada reforça meu objetivo: criar soluções digitais relevantes, humanas e bem construídas.",
  "next": "Próxima Seção"
}

      }
    }

