{
  "en": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Learn More"
    },
    "headings": {
      "portfolio_intro": "DEVELOPER FULL-STACK, FUTURE SOFTWARE ENGINEER. ",
      "about_me": "About Me",
      "hello": "Hello, I'm"
    },
    "content": {
      "introduction": "I'm a Developer and Designer based in Brazil, passionate about creating modern, functional and visually stunning digital experiences. I specialize in building interactive interfaces and I'm always improving my skills in UI/UX design and Development. I love exploring new technologies and turning ideas into reality through code and design.",
      "skills": {
        "web_dev": {
          "title": "Web Development",
          "description": "Specializing in creating visually stunning and user-friendly websites. Proficient in CSS, JavaScript, Python, and modern frameworks like React and Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "UI/UX Design",
          "description": "Passionate about crafting intuitive and engaging user experiences. Skilled in UI/UX design, leveraging tools like Figma, along with user research methodologies, marketing strategies, and conversion optimization techniques to enhance usability and business impact."
        },
        "software_development": {
          "title": "Software Development",
          "description": "Aiming to transition into software development, with a focus on building scalable and efficient applications. Familiar with Python, Java, and backend technologies."
        }
      }
    },
"journey": {
  "label": "Journey",
  "title": "My Journey",
  "description": "A path built through curiosity, learning, and constant improvement.",
  "steps": [
    {
      "title": "First Steps",
      "content": "I started getting into programming around the age of 10, during the pandemic, through free courses and online content. That was when I learned the basics of HTML, CSS, and JavaScript and began to understand how things work behind the screen."
    },
    {
      "title": "Learning & Practice",
      "content": "As my interest grew, I decided to pursue this path academically and joined IFRJ in Engenheiro Paulo de Frontin. There, I strengthened my foundations in logic, algorithms, and web development, while continuing to study on my own through courses, documentation, and tutorials in both Portuguese and English."
    },
    {
      "title": "Continuous Evolution",
      "content": "Today, I study Software Engineering and keep building personal projects, always focused on learning, improving, and creating digital solutions that are useful, well-designed, and meaningful."
    }
  ],
  "next": "Next Section"
}


  },

  "pt": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Saiba Mais"
    },
    "headings": {
      "portfolio_intro": "DESENVOLVEDOR FULL-STACK, FUTURO ENGENHEIRO DE SOFTWARE .",
      "about_me": "Sobre Mim",
      "hello": "Olá, eu sou"
    },
    "content": {
      "introduction": "Sou um Desenvolvedor e Designer do Brasil, apaixonado por criar experiências digitais modernas, funcionais e visualmente impressionantes. Especializo-me na construção de interfaces interativas e estou sempre aprimorando minhas habilidades em design UI/UX e desenvolvimento. Adoro explorar novas tecnologias e transformar ideias em realidade através do código e do design.",
      "skills": {
        "web_dev": {
          "title": "Desenvolvimento Web",
          "description": "Especializado na criação de sites visualmente impressionantes e fáceis de usar. Proficiente em CSS, JavaScript, Python e frameworks modernos como React e Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "Design UI/UX",
          "description": "Apaixonado por criar experiências de usuário intuitivas e envolventes. Hábil em design UI/UX, utilizando ferramentas como Figma, além de metodologias de pesquisa de usuários, estratégias de marketing e técnicas de otimização de conversão para melhorar a usabilidade e o impacto nos negócios."
        },
        "software_development": {
          "title": "Desenvolvimento de Software",
          "description": "Com o objetivo de fazer a transição para o desenvolvimento de software, com foco na construção de aplicativos escaláveis e eficientes. Familiarizado com Python, Java e tecnologias de backend."
        }
      }
    },
     "journey": {
  "label": "Jornada",
  "title": "Minha Jornada",
  "description": "Uma trajetória construída por curiosidade, aprendizado e evolução constante.",
  "steps": [
    {
      "title": "Primeiros Passos",
      "content": "Comecei a me interessar por programação por volta dos 10 anos, durante a pandemia, por meio de cursos livres e conteúdos online. Foi nesse período que tive contato com HTML, CSS e JavaScript e comecei a entender como as coisas funcionavam por trás da tela."
    },
    {
      "title": "Aprendizado e Prática",
      "content": "Com o crescimento desse interesse, ingressei no IFRJ de Engenheiro Paulo de Frontin, no curso de Informática para Internet. Lá, consolidei minha base em lógica, algoritmos e desenvolvimento web, enquanto continuava estudando por conta própria com cursos, documentação e tutoriais em português e inglês."
    },
    {
      "title": "Evolução Contínua",
      "content": "Hoje, estudo Engenharia de Software e desenvolvo projetos próprios, sempre buscando aprender mais e criar soluções digitais úteis, bem pensadas e com impacto real."
    }
  ],
  "next": "Próxima Seção"
}

      }
    }

