{
  "en": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Learn More"
    },
    "headings": {
      "portfolio_intro": "This is my portfolio",
      "about_me": "About Me",
      "hello": "Hello, I'm"
    },
    "content": {
      "introduction": "I'm a Developer and Designer based in Brazil, passionate about creating modern, functional and visually stunning digital experiences. I specialize in building interactive interfaces and I'm always improving my skills in UI/UX design and Development. I love exploring new technologies and turning ideas into reality through code and design.",
      "skills": {
        "web_dev": {
          "title": "Web Development",
          "description": "Specializing in creating visually stunning and user-friendly websites. Proficient in CSS, JavaScript, Python, and modern frameworks like React and Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "UI/UX Design",
          "description": "Passionate about crafting intuitive and engaging user experiences. Skilled in UI/UX design, leveraging tools like Figma, along with user research methodologies, marketing strategies, and conversion optimization techniques to enhance usability and business impact."
        },
        "software_development": {
          "title": "Software Development",
          "description": "Aiming to transition into software development, with a focus on building scalable and efficient applications. Familiar with Python, Java, and backend technologies."
        }
      }
    },
      "journey": {
        "title": "My Journey",
        "description": "A journey of discoveries, challenges, and achievements in the world of technology.",
        "paragraph": "Since I was 10 years old, striving to stand out, I found a passion in programming.",
"content_journey": "When I started learning programming on my own at the age of 10, I knew it could take me to great places. Despite the challenges of accessing paid content, my motivation only grew. At 14, I discovered IFRJ in Eng. Paulo de Frontin, focused on Internet Technology, and a new door opened for me. There, I became involved in various academic activities, such as lectures, scientific research projects, article publications, and I was also a monitor for computer classes for underprivileged communities and the elderly. Now, as a graduate, I am still developing new skills and learning programming languages, always seeking more knowledge. Through growing networking and a change in my lifestyle, I’m becoming not only a better professional but also a more grounded and adaptable person, opening doors for a promising future as a developer.",
        "next": "Next Section"
      }
    },

  "pt": {
    "buttons": {
      "portuguese": "Português",
      "english": "English",
      "learn_more": "Saiba Mais"
    },
    "headings": {
      "portfolio_intro": "Este é meu portfólio",
      "about_me": "Sobre Mim",
      "hello": "Olá, eu sou"
    },
    "content": {
      "introduction": "Sou um Desenvolvedor e Designer morando no Brasil, apaixonado por criar experiências digitais modernas, funcionais e visualmente impressionantes. Especializo-me na construção de interfaces interativas e estou sempre aprimorando minhas habilidades em design UI/UX e desenvolvimento. Adoro explorar novas tecnologias e transformar ideias em realidade através do código e do design.",
      "skills": {
        "web_dev": {
          "title": "Desenvolvimento Web",
          "description": "Especializado na criação de sites visualmente impressionantes e fáceis de usar. Proficiente em CSS, JavaScript, Python e frameworks modernos como React e Tailwind CSS."
        },
        "ui_ux_design": {
          "title": "Design UI/UX",
          "description": "Apaixonado por criar experiências de usuário intuitivas e envolventes. Hábil em design UI/UX, utilizando ferramentas como Figma, além de metodologias de pesquisa de usuários, estratégias de marketing e técnicas de otimização de conversão para melhorar a usabilidade e o impacto nos negócios."
        },
        "software_development": {
          "title": "Desenvolvimento de Software",
          "description": "Com o objetivo de fazer a transição para o desenvolvimento de software, com foco na construção de aplicativos escaláveis e eficientes. Familiarizado com Python, Java e tecnologias de backend."
        }
      }
    },
      "journey": {
        "title": "Minha Trajetória",
        "description": "Uma jornada de descobertas, desafios e conquistas no mundo da tecnologia.",
        "paragraph": "Desde os 10 anos, buscando diferenciar-me, encontrei na programação uma paixão.",
  "content_journey": "Quando comecei a aprender programação de forma autodidata, aos 10 anos, sabia que isso poderia me levar a grandes lugares. Mesmo com as dificuldades de acessar conteúdos pagos, minha motivação só aumentou. Aos 14 anos, conheci o IFRJ de Eng. Paulo de Frontin, voltado para Tecnologia para Internet, e uma nova porta se abriu. Lá, me envolvi em várias atividades acadêmicas, como palestras, projetos de iniciação científica, publicação de artigos, e também fui monitor de aulas de informática para comunidades carentes e idosos. Hoje, formado, continuo desenvolvendo novas habilidades e aprendendo linguagens de programação, sempre em busca de mais conhecimento. Através de um networking crescente e com a mudança de hábitos de vida, estou me tornando não só um profissional melhor, mas também uma pessoa mais centrada e adaptável, abrindo portas para um futuro promissor como desenvolvedor.",
        "next": "Próxima Seção"
      }
    }
  }

